# System Zone Element Type Heating Set Point Property

Source: https://www.revitapidocs.com/2026/afa6b22d-2c93-8da5-5aaa-76e899e8be43.htm

---

| System Zone Element Type Heating Set Point Property |
| --- |

The heating temperature set point in unit Kelvin (K).
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double HeatingSetPoint { get; set; }
```

```
Public Property HeatingSetPoint As Double
	Get
	Set
```

```
public:
property double HeatingSetPoint {
	double get ();
	void set (double value);
}
```

```
member HeatingSetPoint : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: |

See Also

#### Reference

SystemZoneElementType Class Autodesk.Revit.DB.Mechanical Namespace